# Core packages — belongs on any personal dev machine.
# Install: brew bundle --file=brew/Brewfile
# Update:  task --global brew:dump

# ---------------------------------------------------------------------------
# Taps
# ---------------------------------------------------------------------------
tap "go-task/tap"
tap "otto-nation/tap"

# ---------------------------------------------------------------------------
# Shell & terminal
# ---------------------------------------------------------------------------
brew "bash"
brew "jq"
brew "tree"
brew "yq"

# ---------------------------------------------------------------------------
# AI tooling
# ---------------------------------------------------------------------------
brew "pipx"
brew "uv"

# ---------------------------------------------------------------------------
# Containers
# ---------------------------------------------------------------------------
brew "docker"

# ---------------------------------------------------------------------------
# Dev workflow
# ---------------------------------------------------------------------------
brew "bats-core"
brew "delta"
brew "gh"
brew "go-task/tap/go-task"
brew "otto-nation/tap/otto-stack"
brew "shellcheck"

# ---------------------------------------------------------------------------
# Security
# ---------------------------------------------------------------------------
brew "gitleaks"

# ---------------------------------------------------------------------------
# Casks
# ---------------------------------------------------------------------------
cask "git-credential-manager"
