# Work / project-specific packages — opt-in during bootstrap.
# Install: brew bundle --file=brew/Brewfile.work
# Update:  WORK=1 task --global brew:dump

# ---------------------------------------------------------------------------
# Taps
# ---------------------------------------------------------------------------
tap "ankitpokhrel/jira-cli"
tap "hashicorp/tap"

# ---------------------------------------------------------------------------
# AWS & cloud
# ---------------------------------------------------------------------------
brew "awscli"
brew "aws-sso-util"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "hashicorp/tap/vault"

# ---------------------------------------------------------------------------
# Java
# ---------------------------------------------------------------------------
brew "gradle"
brew "jenv"
brew "maven"

# ---------------------------------------------------------------------------
# Terraform
# ---------------------------------------------------------------------------
brew "terraform-docs"
brew "tfenv"

# ---------------------------------------------------------------------------
# Kubernetes
# ---------------------------------------------------------------------------
brew "helm"
brew "kubernetes-cli"

# ---------------------------------------------------------------------------
# Services
# ---------------------------------------------------------------------------
# Note: postgresql@14 is deprecated upstream; replace with postgresql@17 when ready
brew "postgresql@14"
brew "rabbitmq"
brew "redis"
brew "nginx"

# ---------------------------------------------------------------------------
# Tools
# ---------------------------------------------------------------------------
brew "cocoapods"
brew "golangci-lint"
brew "hugo"
brew "liquibase"
brew "openapi-generator"
brew "openvpn"

# ---------------------------------------------------------------------------
# Casks — Filesystem / network
# ---------------------------------------------------------------------------
cask "fuse-t"
cask "fuse-t-sshfs"
cask "switchhosts"
