# Core packages — belongs on any personal dev machine.
# Install: brew bundle --file=brew/Brewfile
# Update:  task --global brew:dump

# ---------------------------------------------------------------------------
# Taps
# ---------------------------------------------------------------------------
tap "go-task/tap"
tap "otto-nation/tap"

# ---------------------------------------------------------------------------
# Shell & terminal
# ---------------------------------------------------------------------------
brew "bash"
brew "jq"
brew "starship"
brew "yq"
brew "zoxide"

# ---------------------------------------------------------------------------
# Dev workflow
# ---------------------------------------------------------------------------
brew "gh"
brew "go-task/tap/go-task"
brew "otto-nation/tap/otto-stack"
brew "shellcheck"

# ---------------------------------------------------------------------------
# Security / GPG
# ---------------------------------------------------------------------------
brew "gnupg"
brew "pinentry-mac"

# ---------------------------------------------------------------------------
# Language version managers
# ---------------------------------------------------------------------------
brew "nvm"
brew "pipx"
brew "uv"

# ---------------------------------------------------------------------------
# Containers
# ---------------------------------------------------------------------------
brew "colima"

# ---------------------------------------------------------------------------
# Casks — Productivity
# ---------------------------------------------------------------------------
cask "hiddenbar"
cask "maccy"
cask "rectangle"

# ---------------------------------------------------------------------------
# Casks — Developer tools
# ---------------------------------------------------------------------------
cask "1password-cli"
cask "bruno"
cask "git-credential-manager"
cask "sublime-text"

# ---------------------------------------------------------------------------
# Casks — Security
# ---------------------------------------------------------------------------
cask "gpg-suite"
